tutorials/multiphase/interFoam/micromodel/0_org/pc
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      pc;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet 
    {
        type            zeroGradient;
    }

    outlet 
    {
        type            zeroGradient;
    }

    solidwalls
    {
        type            zeroGradient;
    }

    walls 
    {
        type            zeroGradient;
    }



    frontandback
    {
        type            empty;
    }
}

// ************************************************************************* //
